set names utf8;
drop database if exists farming;
create database farming charset=utf8;
use farming;

create table t_new1(
    id int primary key auto_increment,
    pic varchar(32),
    title varchar(200),
    time datetime,
    content varchar(2048)
);
create table t_new2(
    id int primary key auto_increment,
    pic varchar(32),
    title varchar(200),
    time datetime,
    content varchar(2048)
);
create table t_new3(
    id int primary key auto_increment,
    pic varchar(32),
    title varchar(200),
    time datetime,
    content varchar(2048)
);

insert into t_new1 values
(null,'new_01.jpg','共同推进“一带一路”建设农业合作的愿景与行动','2017-05-12 11:29:05','进入21世纪，世界经济一体化加快推进，以和平、发展、合作、共赢为主题的新时代已经开启。2013年9月和10月，中国国家主席习近平在出访中亚和东南亚国家期间，先后提出共建“丝绸之路经济带”和“21世纪海上丝绸之路”（以下简称“一带一路”）的重大倡议，得到国际社会高度关注。'),
(null,'news2.jpg','《共建“一带一路”：理念、实践与中国的贡献》','2017-05-12 11:00:44','2013年9月和10月，中国国家主席习近平先后提出共建“丝绸之路经济带”和“21世纪海上丝绸之路”（以下简称“一带一路”）倡议，得到国际社会的高度关注和有关国家的积极响应。'),
(null,'news3.jpg','第19届中国国际花卉园艺展览会明日召开！','2017-05-09 14:43:05','由中国花卉协会主办、上海国展展览中心有限公司及长城国际展览有限责任公司承办的第19届中国国际花卉园艺展览会(HortiflorexpoIPMShanghai2017)如约来到上海新国际博览中心，将于将于2017年5月10日—12日再度举行。'),
(null,'news4.jpg','大力推进农业绿色发展',' 2017-05-09 15:32:33','大力推进农业绿色发展。来源：人民日报');

insert into t_new2 values
(null,'new_02.jpg','中国农业大学专家教授参观指导第五届北京农业嘉年华','2017-04-21 13:26:46','2017年4月19日，中国农业大学老专家教授组团到第五届北京农业嘉年华参观指导。'),
(null,'news6.jpg','中农四方总经理参加中国农业大学校友创业训练营','2017-03-29 10:11:19','近日，中国农业大学企业家校友联谊会、校友股权投资基金、MBA教育中心共同成立的“校友创业训练营”首期正式开营。'),
(null,'news7.jpg','北京中农四方参加第二届阳城农业嘉年华研讨会','2017-03-24 09:53:12','3月22日下午，在相府庄园酒店北京中农四方农业规划设计研究院总经理王振力参加了第二届阳城农业嘉年华研讨会，此次会议确定了第二届阳城农业嘉年华活动举办地点为“皇城相府庄园”，举办时间为“2017年7月-10月”，由北京九鼎辉煌旅游发展研究院朱万锋院长向各位领导汇报了阳城县第二届农业嘉年华的设计思路'),
(null,'news8.jpg','第五届北京农业嘉年华迎来重要客人！','2017-03-24 09:53:12','3月22日下午，在相府庄园酒店北京中农四方农业规划设计研究院总经理王振力参加了第二届阳城农业嘉年华研讨会，此次会议确定了第二届阳城农业嘉年华活动举办地点为“皇城相府庄园”，举办时间为“2017年7月-10月”，由北京九鼎辉煌旅游发展研究院朱万锋院长向各位领导汇报了阳城县第二届农业嘉年华的设计思路');

insert into t_new3 values
(null,'new_03.jpg','历史文化型特色小镇——天台山和合小镇','2017-05-08 16:54:18','突出文化底蕴，做好以“和合圆融”为核心的天台山文化传承、保护、创新、利用，充分发挥天台山文化的感召力和影响力，打造国际性文化高地，最大限度地满足群众需求、激发文化创新活力、增强文化软实力，推动文化产业规模化、融合化发展，以文化引领大众思想凝聚、城市形象提升、县域转型发展。'),
(null,'news10.jpg','历史文化型特色小镇——南浔善琏湖笔小镇',' 2017-04-26 18:06:03','南浔善琏湖笔小镇，古镇制笔的历史可以上溯到2000多年前。善琏湖笔制作分工极细，每道主要工序只能由专人完成，因此每位笔工一生只能从事其一。这种沿袭至今的分工也保证了湖笔制作的高质量。'),
(null,'news11.jpg','历史文化型特色小镇——越城黄酒小镇','2017-04-20 16:44:25','“越酒闻天下，东浦酒最佳”。作为绍兴黄酒的发祥地，东浦古镇留下了千年的历史印记，如今再度走进世人眼帘，有人称恍如隔世。而今，在全省特色小镇建设的推进下，千年酒国即将华丽回归。'),
(null,'news12.jpg','历史文化型特色小镇——莲都区古堰画乡小镇',' 2017-04-19 15:44:06','古樟、码头、老街、画室，走进古堰画乡，时间仿佛放慢了脚步，一切显得如此的惬意和恬静。'),
(null,'news13.jpg','历史文化型特色小镇——龙泉青瓷小镇','2017-04-18 14:08:14','一千多年来，龙泉青瓷历经兴盛冷落、几起几伏。1465年，明朝实行了海禁，“片板不许下海”，自此，龙泉窑开始日薄西山。');




create table t_feature1(
    id int primary key auto_increment,
    pic varchar(32),
    title varchar(200),
    time datetime,
    content varchar(2048)
);
create table t_feature2(
    id int primary key auto_increment,
    pic varchar(32),
    title varchar(200),
    time datetime,
    content varchar(2048)
);

insert into t_feature1 values
(null,'group1_02.jpg','马铃薯能减肥？看完我真的信了！','2017-04-07 08:36:35','“四月不减肥，五月徒伤悲”据说减肥成功的人都点开看了！'),
(null,'group1_03.jpg','吃喝畅玩一条龙，就在第五届北京农业嘉年华薯国演义','2017-04-06 15:38:53','北京游玩最好的地方，别说我没告诉你哦！'),
(null,'group1_04.jpg','第五届北京农业嘉年华除了蔬菜和花还有什么？','2017-04-01 16:24:10','在第五届北京嘉年华缤纷农业馆除了花馆（丝路花语）、蔬菜馆（蔬香味道）、马铃薯馆（薯国演义）、豆子馆（豆彩工坊）还有一个草药馆（本草华堂）哦！'),
(null,'group1_05.jpg','农业嘉年华豆彩工坊，带您认识最全的豆子家族！','2017-03-31 15:34:49','豆子的起源，豆子的种植，豆子的轻加工，豆子的深加工，豆子的美食，豆子的游戏 这里应有尽有哦！'),
(null,'group1_06.jpg','真稀奇，原来蔬菜还能长成这样！内含福利哦！（二）','2017-03-29 11:56:01','除了小可爱多黄瓜和带皮番茄，在第五届北京农业嘉年华蔬香味道馆还有哪些特殊蔬菜今日一一为您奉上！'),
(null,'group1_07.jpg','第五届北京农业嘉年华之蔬香味道场馆','2017-03-14 10:25:23','中国的蔬菜种植历史悠久，不同味道的蔬菜已成为百姓家庭生活不可或缺的一部分。第五届北京农业嘉年华蔬菜主题馆（西区2号馆）由北京中农四方农业规划设计研究院担任策划设计、施工运维工作。');

insert into t_feature2 values
(null,'group2_02.jpg','农业嘉年华回顾——南京农业嘉年华','2017-03-08 18:59:01','第十二届中国·南京农业嘉年华以“农情之约、我心乡往”为活动主题，始终贯彻“农耕天下 欢乐大家”的品牌理念，于2016年9月28日在南京江宁台湾农民创业园开幕，于2016年11月20日落幕，为期54天。'),
(null,'group2_03.jpg','山西农业嘉年华之场馆设计','2017-03-08 00:00:00','阳城之美，美在自然造化，美在历史赋存，美在文化底蕴。阳城县有“中国北方第一文化巨宅”、国家5A级景区皇城相府，以及中华名山析城山、蟒河自然保护区与九女仙湖自然风光旅游区等优质旅游资源。结合这些丰富的自然人文旅游资源，阳城县推出“悠然阳城”旅游品牌。'),
(null,'group2_04.jpg','武汉农业嘉年华之场馆设计','2017-03-06 13:21:01','首届武汉农业嘉年华于2016年3月26日开幕，5月29日闭幕，共历时65天。首届武汉农业嘉年华，选址于武汉市东西湖区柏泉农场农科所基地，占地270亩。'),
(null,'group2_05.jpg','贵阳农业嘉年华之场馆设计','2017-02-24 15:53:07','第二届贵阳农业嘉年华于2016年8月18日在贵阳国家农业园区开幕,本届农业嘉年华是贵阳市打造山地都市现代农业发展升级版,助推三次产业深度融合的重要平台,按照“一带一路一花园、四韵五景六篇章”进行总体规划建设,最终实现“园区变景区、田园变公园、产品变商品”的目标。'),
(null,'group2_06.jpg','贵阳农业嘉年华','2017-02-22 16:29:38','贵阳第二届农业嘉年华于2016年8月18日与贵阳市乌当区开幕。都市农业创意区占地面积30亩，由5个温室场馆组成，即以蔬果为主题的多彩蔬苑馆，以草药为主题的黔金草药馆，以蜜蜂为主题的蜂彩世界馆，以水生植物为主题的水生世界馆，以展示现代农业科技为主的智慧农场馆。');



create table t_case3(
    id int primary key auto_increment,
    pic varchar(32),
    title varchar(200),
    time datetime,
    content varchar(2048)
);
create table t_case4(
    id int primary key auto_increment,
    pic varchar(32),
    title varchar(200),
    time datetime,
    content varchar(2048)
);
create table t_case5(
    id int primary key auto_increment,
    pic varchar(32),
    title varchar(200),
    time datetime,
    content varchar(2048)
);
insert into t_case3 values
(null,'group3_02.jpg','第八届北京菊花文化节','2017-02-26 16:19:30','本届菊花文化节，室外展，以“梦幻花园”为主题，种植各类花卉81种，种植面积达到82923平方米，主要展示24个品种的小丽花和5个品种的千头菊，搭配以42个品种各色草花(以菊科花卉为主)。'),
(null,'group3_03.jpg','高青农博会4','2017-02-24 16:26:59','高青农博会4'),
(null,'group3_04.jpg','高青农博会3','2017-02-24 16:26:46','高青农博会3'),
(null,'group3_05.jpg','高青农博会2','2017-02-24 16:26:32','高青农博会2'),
(null,'group3_06.jpg','高青农博会1',' 2017-02-24 16:26:14','高青农博会1');

insert into t_case4 values
(null,'group4_06.jpg','广西南宁嘉乐园生态旅游园区规划','2017-02-26 15:56:54','广西南宁嘉乐园生态旅游园区规划'),
(null,'group4_07.jpg','辽宁鹤野稻香园','2017-02-26 15:46:53','辽宁鹤野稻香园'),
(null,'group4_04.jpg','陕西农业庄园','2017-02-26 15:27:55','陕西新叶园公司拥有水稻基地、槐树林基地等，生产五常大米、粗粮、食用油、醋、蜂蜜等无公害优质农产品，创建了自己的品牌，资源丰富。');

insert into t_case5 values
(null,'group5_06.jpg','蔬菜景观','2017-02-26 16:44:46','蔬菜景观'),
(null,'group5_07.jpg','新奇特蔬菜苗生产','2017-02-24 16:37:46','新奇特蔬菜苗生产'),
(null,'group5_04.jpg','阳台农业','2017-02-24 16:35:19','阳台农业'),
(null,'group5_05.jpg','立体无土栽培','2017-02-24 16:35:02','立体无土栽培');

create table t_message(
    id int primary key auto_increment,
    cname varchar(50),
    uname varchar(10),
    time bigint,
    phone varchar(11),
    email varchar(30),
    content varchar(2048)
);
insert into t_message values
(null,'北京国音红杉树有限公司','赵大旭',1458796325784,'15878945147','1125963214@qq.com','积于不涸之仓者，务五谷也；藏于不竭之府者，养桑麻育六畜也。'),
(null,'江苏玉泰科技','张晓梅',1548587436542,'15893647859','1125820745@qq.com','社会为生产小麦，家畜等等所需要的时间越少，它对其它生产，不论是物质的生产或精神的生产所获得时间便越多。超过劳动者个人需要的农业劳动生产率，是一切社会的基础。'),
(null,'安徽航云数据有限公司','郭俊俊',1448796521478,'18737249572','944528734@qq.com','小满暖洋洋，锄麦种杂粮。');








